# 1) for ციკლის მეშვეობით დაბეჭდე ყველა რიცხვი 1-დან 20-ის ჩათვლით
for i in range(1,21):
    print(i)
# 2) for ციკლის მეშვეობით დაბეჭდე ყოველი მეორე რიცხვი 0-დან 10-ის ჩათვლით
for i in range(0,11,2):
    print(i)
# 3) დაბეჭდე ყველა რიცხვი 20-დან 10-მდე
for i in range(20,10,-1):
    print(i)
# 4) შექმენი ცვლადი სადაც შეინახავ string-ს. გადაუარე მას for ციკლით, გაიგე რამდენი სიმბოლოა სთრინგში და დაბეჭდე
word = "helo"
number = 0
for i in word:
    number = number+1
print(number+word)
# 5) for ციკლის დახმარებით დაბეჭდე ყველა ლუწი რიცხვი 1-დან 10-მდე
for i in range(2,10,2):
    print(i)
# 6) for ციკლის დახმარებით დაბეჭდე ყველა კენტი რიცხვი 0-დან 10-ის ჩათვლით
for i in range(1,10,):
    print(i)