# 2) მომხარებელს შემოატანინე ჯერ მისი სახელი, შემდეგ ასაკი და დაპრინტე მომხარებლის სახელი იმდენჯერ, რამდენი წლისაც არის(გამოიყენე გამრავლება)
name = input("введите свое имя")
age = input("введите свой возраст")
# 3) მომხარებელს შემოატანინე სამი რიცხვი და გაიგე მათი საშუალო არითმეტიკული

# 4) გააკეთე თითოეულ მათემატიკურ ოპერატორზე(+, -, *, /) 4-4 მაგალითი
print(364+755)
print(765+678)
print(984+868)
print(768+989)
print(678-987)
print(879-789)
print(987-876)
print(788-655)
print(89*7)
print(76*8)
print(78*7)
print(76*5)
print(65/7)
print(67/7)
print(98/8)
print(67/7)
# 5) კომენტარებით ახსენი ყველა ნასწავლი მონაცემთა ტიპი, ჩამოწერე თუ რა ახასიათებთ მათ და მოიყვანე მაგალითები
