# 2)მომხარებელს შემოატანინე სახელი და გვარი, შეინახე ისინი ცვლადებში და გამოიტანე წინადადება "Hello {სახელი} {გვარი}"
# я должен запростиь у пользователя имя и фамилию
# для этого:
# 1) создать переменные name и surname в которых будет хранится имя и фамилия пользователя
# 2) мне нужна input()-функция

name = input("Пожалуйста запишите своё имя: ")
surname = input("Пожалуста запишите свою фамилию: ")

# Я должен вывести сообщение приветсвия на экран
# для этого:
# 1) использую print()-функцию
# 2) использую переменные name и surname

print("Пивет", name, surname)
# 3)გააკეთე input-ებზე 5 მაგალითი

# 4)აღწერე თითოეული მოქმედება კომენტარებით