# 1) შექმენით სია რომელშიც იქნება 10 სხვადასხვა რენდომ რიცხვი, შემდეგ მიწდვით ამ სიის თითოეულ ელემენტს და დაბეჭდეთ თითოეული ელემენტი ოღონდ თუ რიცხვი იქნება ხუთის ჯერადი მიუწერეთ გვერძე რომ ხუთის ჯერადია ხოლო სამის ჯერადებს მიუწერეთ რომ სამის ჯერადია
numbers = [23,65,64,98,32,54,45,32,98,89]
for i in range(len(numbers)):
    if numbers[i] % 5 == 0:
        print(numbers[i])
    elif numbers[i] % 3 == 0:
        print(numbers[i])


# 2)შექმენი ცარიელი სია სადაც დაამათენ(append) ცხოველების სახელს შემდეგ გამოიტან მიღებულ შედეგს
animals = []
animals.append("лев")
animals.append("тигр")
animals.append("лягушка")
animals.append("кролик")
animals.append("олень")
print(animals)
