# 1) კომენტარებით ახსენი, თუ რა არის სია
# список ето на пример если ты идеш в магазин и ты не хочеш забыть что то купить
# 2) ახსენი რა არის ინდექსინგი და რაში გვჭირდება ის
# индекс ето уникальная цыфра
# 3) შექმენი სია შემდგარი 5 ელემენტისგან, სადაც შეინახავ მანქნის სახელებს. შენი დავალებაა ჯერ დაბეჭდო ეს სია, შემდეგ შეცვალო მე-3 ელემენტი და თავიდან დაბეჭდო სია
cars =  ["BMW","Mersedes","mazda","lamborgini","bugat"]
print(cars)

print(cars[3])
cars[3] = "adri"
print(cars)


# 4) შექმენი რიცხვების სია, გადაუარე მას for ციკლით და დაბეჭდე თითოეული მისი ელემენტი ცალ-ცალკე
number = [34,85,75,87,87,90,89,95]
print(number)
for i in number:
    print(i)


  