# 1) კომენტარებით ახსენი, თუ რა არის len ფუნქცია და append ფუნქცია
#функция len проверяет сколько елементов в списке,
# а функция append например ты сделал список который пустой и ты пишеш с начала название списка потом точку 
# и append потом круглые скобки а в них слова или цыфры
# # 2) მომხარებელს შემოატანინე 5 რციხვი for ციკლის მეშვეობით და ჩაამატე ისინი ცარიელ სიაში append ფუნქციის გამოყენებით. საბოლოოდ დაბეჭდე ეს სია
numbers = []

for _ in range(5):
     num = int(input("Please eneter a number: "))
     numbers.append(num)

print(numbers)
# 3) შექმენი ცარიელი სია, შემდეგ for ციკლის მეშვეობით 0-დან 100-ის ჩათვლით ყველა 5-ის ჯერადი რიცხვი ჩაამატე შექმნილ სიაში (გამოიყენე append ფუნქცია) და დაბეჭდე ის
numbers1 = []

for i in range(100):
    
    if i % 5 == 0