def hello():
    print("hi")
hello()
# 2)შექმენი ფუნქცია, რომელიც იპოვის ყველა რიცხვის ჯამს 1-დან რიცხვამდე. რიცხვი ყოველთვის იქნება 0-ზე მეტი მთელი რიცხვი. თქვენი საჭირო პროდუქტის საჭიროება, რაც არის ნაჩვენები, მათ შორის არის ეს მაგალითი, თუ როგორ მივაღწიოთ ამ შედეგს და ის არ არის ნაწილი,
# მაგალითი: 
# 2 -> 3 (1 + 2)
# 8 -> 36 (1 + 2 + 3 + 4 + 5 + 6 + 7 + 8)
# def num():
#     num = int(input("enter a number:  "))

#     number = 0

#     for i in range(num + 1):
#         number += i
#     print(number)
# num()