# 1) მომხარებელს შემოატანინე რიცხვი, გაამრავლე ის 2-ზე და დაბეჭდე 1-დან მიღებული რიცხვის ჩათვლით, ყველა რიცხვი
number=int(input("enter a number"))

for i in range(1,number*2+1):
    print(i)
# 2) მომხარებელს შემოატანინე ნებისმიერი სიტყვა და დაბეჭდე მისი თითოეული სიმბოლო
word = input("enter a word")

for i in word:
    print(i)
# 3) შექმენი ცვლადი სადაც შეინახავ სთრინგს "banana". შენი დავალებაა for ციკლით გადაუარო ამ სთრინგს და დაბეჭდო მისი თოთოეული ელემენტი და გვერდით მიუწერო მერამდენე სიმბოლოა ის. (უნდა გამოვიდეს ასე: "banana" >>> "b - 1", "a - 2", "n - 3"...)
word = "banana"
index=1
for i in word:
    print(i+" - "+str(index))
    index=index+1
# 4) გადახედე ამ რესურსს თავიდან ბოლომდე: