# # 2)  მომხმარებელს შეეკითხეთ სახელი შემდეგ შექმენით ფუნქცია რომელსაც ექნება ერთი პარატემტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი სახელი შემდეგ კი მას მიეს
# def hi(name):
#     print(name,"hi")
# name = input("enter your name")
# hi(name)
# # 3) მომხმარებელს შეეკითხეთ ორი რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება ორი პარატემტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვები შემდეგ კი დაბეჭდავს მათ ჯამს 
# def num(number,number1):
#     print(number + number1)
# number = int(input("please enter a number"))
# number1 = int(input("please enter a number"))
    
# num(number,number1)
# # 4) მომხმარებელს შეეკითხეთ ორი რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება ორი პარატემტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვები შემდეგ კი დაბეჭდავს მათ განაყოფს
# def num1(number2,number3):
#     print(number2 / number3)
# number2 = int(input("please enter a number"))
# number3 = int(input("please enter a number"))

# num1(number2,number3)
# # 5) მომხმარებელს შეეკითხეთ ორი რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება ორი პარატემტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვები შემდეგ კი დაბეჭდავს მათ ნამრავლს
# def num2(x,y):
#     print(x*y)
# number4 = int(input("please enter a number"))
# number5 = int(input("please enter a number"))

# num2(number4,number5)
# # 6) მომხმარებელს შეეკითხეთ ორი რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება ორი პარატემტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვები შემდეგ კი დაბეჭდავს მათ განაყოფს
# def num3(x,y):
#     print(x/y)
# number6 = int(input("please enter a number"))
# number7 = int(input("please enter a number"))

# num3(number6,number7)
# # 7) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი დაბეჭდავს ეს რიცხვი ლუწია თუ კენტი
# def num4(x):
#     if x % 2 == 0:
#         print("even")
#     elif x % 2 != 0:
#         print("odd")
# number8 = int(input("please enter a number"))

# num4(number8)
# # 8) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი დაბეჭდავს ეს რიცხვი დადებითია თუ უარყოფითი
# def num5(x):
#     if x < 0:
#         print("number is less than zero")
#     elif x > 0:
#         print("number is biger than zero")
# number9 = int(input("please enter a number"))

# num5(number9)
# # 9) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი თუ 18 ზე უთხრას რომ სრულწლოვანია თუარადა არარის
# def num6(x):
#     if x < 18:
#         print("number is less than 18")
#     elif x >= 18:
#         print("number is bigger than 18")
# number0 = int(input("please enter a number"))

# num6(number0)
# # 10) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი ერთიდან იმ რიცხვამდე დაბეჭდავს ყველა რიცხვს
# def num6(x):
#     for i in range(x):
#         print(i)
# number11 = int(input("please enter a number"))

# num6(number11)
# # 11) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი ერთიდან იმ რიცხვამდე დაბეჭდავს ყველა ლუწ რიცხვს
# def num6(x):
#     for i in range(x):
#         if x % 2 == 0:
#             print(i)
# number11 = int(input("please enter a number"))

# num6(number11)
# # 12) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი ერთიდან იმ რიცხვამდე დაბეჭდავს ყველა კენტ რიცხვს
# def num6(x):
#     for i in range(x):
#         if x % 2 != 0:
#             print(i)
# number11 = int(input("please enter a number"))

# num6(number11)


def num1():
    num = str((45))
num1(num1)