# # 1) მომხარებელს შემოატანინე რიცხვი და დაბეჭდე 1-დან შემოტანილი რიცხვის ჩათვლით ყველა კენტი რიცხვის ჯამი
# number = int(input("enter a number"))
# i = 0
# while number > i:
#     i += 1
#     print(i)
# 2) მომხარებელს შემოატანინე რიცხვი და დაებეჭდე 1-დან შემოტანილ რიცხვამდე ყველა ლუწი რიცხვის ნამრავლი
# number = int(input("enter a number: "))
# i = 2
# x = 1
# while number > i:
#     x *= i
#     i += 2
# print(x)
# 3) შექმენი ცვლადი სადაც შეინახავ string-ს. გადაუარე მას for ციკლით, გაიგე რამდენი სიმბოლოა სთრინგში და დაბეჭდე
word = "enter a word: "
count = 0
for i in word:
    count+=1
print(count)
# 4) while ციკლის დახმარებით დაბეჭდე ყველა ლუწი რიცხვი 1-დან 10-მდე
# i = 0
# while i<10:
#      i += 1
#      print(i)
#  # 5) while ციკლის დახმარებით დაბეჭდე ყველა კენტი რიცხვი 0-დან 10-ის ჩათვლით
# i = 0
# while i < 8:
#      i += 3
#      print(i)