num = "50"
num2 = 56
num3 = 50.57

print (num + str(num2) + str(num3))

# 3)ახსენი თითოული მატემატიკური მნიშვნელობები
# * Используется для умножения двух чисел,// Делит одно число на другое и возвращает только целую часть результата (без остатка), + Складывает два числа, / Обычное деление с результатом в виде десятичной дроби,< Проверяет, меньше ли первое число второго,> Проверяет больше ли первое число второго,

#4)ნებისმიერი რიცხვები აირჩიე და თითოეული მათემატიკური მაგალითი გააკეთე რაც ახლა გავიარეთ
print(67 / 2)
print(56*3)
print(90+12)
print(45 // 5)
print(34<35)
print(67 > 23)
print(45 <= 234)
print(334>=323)
print(56 != 23)
print(34-12)
