# შექმენი ცვლადი რომელიც თავდაპირველად 0 იქნება შემდეგ შექმენი foer და დაუმატე 5დან 100 ყველა მე5 რიცხვი და დაპირნტე შედეგი
num = 0

for i in range(5,100,5):
    num += i
    print(num)

# შეეკითხე მომხმარებელს ასაკი შემდეგ შეამოწმე თუ მისი ასაკი მეტია 18 თუ მეტია მაში დაუწერე მეტია 18 ასევე შეეკითხე თუ მეტია 50ზე მაშინ დაუწერე მეტია 50 და თუ არც 50 მეტია და არც 18ზე მაშინ დაწერეს ნაკელბა 18ზე
age = int(input("enter your age: "))

if age > 18 and age <= 50:
    print("age is beger then 18")
elif age > 50:
    print("age is beger then 50")
else:
    print("age is smaller then 18")