# 1) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი დაბეჭდავს ეს რიცხვი ლუწია თუ კენტი
def number1(x):
    if x % 2 == 0:
        print("number is even")
    else:
        print("number is odd")
num = int(input("enter a number: "))
number1(num)
# 2) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი დაბეჭდავს ეს რიცხვი დადებითია თუ უარყოფითი
def number2(x):
    if x > 0:
        print("number is positive")
    else:
        print("number is negative")
num1 = int(input("enter a number: ")) 
number2(num1)
# 3) მომხმარებელს შეეკითხეთ რიცხვი შემდეგ შექმენით ფუნქცია რომელსაც ექნება პარამეტრი რომელსაც არგუმენტად გადაეცემა მომხლარებლის შემოტანილი რიცხვი შემდეგ კი თუ 18 ზე უთხრას რომ სრულწლოვანია თუარადა არარის
def number3(x):
    if x > 18:
        print("you are old")
    else:
        print("you are young")
num2 = int(input("enter your age"))
number3(num2)