# 1) კომენტარებით ახსენი რა არის range ფუნქცია და ისაუბრე მის თითოეულ დეტალზე
# range ето
# 2) დაბეჭდე ყველა რიცხვი 1-დან 200-მდე
for i in range(1,200):
    print(i)
# 3) დაბეჭდე ყველა რიცხვი 10-დან 1-მდე
for i in range(10,1,-1):
    print(i)
# 4) დაბეჭდე ყველა ლუწი რიცხვი 1-დან 10-ის ჩათვლით
for i in range(2,1,2):
    print(i)
# 5) შეეცადე დაამთავრო საკლასო დავალება(მოიძიე რესურსები)

# 1-დან 10-მდე ყველა რიცხვს გადაუარე და თუ ის ლუწია დაბეჭდე "Number is Even", სხვა შემთხვევაში დაბეჭდე "Number is Odd"

