# 1) შექმენი სახელების სია. გადაუარე მას for ციკლით და დაბეჭდე თითოეული სახელი ორჯერ(ერთმანეთის გვერდით)
# names = ["adri","nika","marika"]
# for i in names:
#     print(i*2)
# 2) შექმენი რიცხვების სია, გაიგე თითოეული რიცხვის ჯამი და დაბეჭდე
numbers = [12,87,65,43,33,55]
number = 0
for i in numbers:
    number += i
print(number)
# 3) შექმენი ორი ცვლადი. პირველში შეინახე სია, მეორეში string-ი. შემდეგ index-ინგის მეშვეობით შეცვალე თითოეული მათგანი და კომენტარებით ახსენი რა მოხდა ორივე შემთხვევაში
# names = ["adri","nika","marika"]
# word = "hello"

# names[1] ="ok"
# word[0] = "by"