# 1) 0-დან 10-ის ჩათვლით დაბეჭდე ყველა ლუწი რიცხცი
for i in range(0,11,2):
      print(i)
# 2) 1-დან 10-მდე დაბეჭდე ყველა კენტი რიცხვი
for i in range(1,10,2):
     print(i)
# 3) დაბეჭდე ყოველი მესამე რიცხვი 1-დან 30-ის ჩათვლით
for i in range(1,31,3):
     print(i)


# 4) შექმენი ცვლადი, სადაც შეინახავ სთინგს. შენი დავალებაა გაიგო მისი სიგრძე და და ბეჭდო ის კვადრატში
word = "enter a word"
count = 0
for i in word:

     count = count + 1

print(count*count)
# 5) დაბეჭდე 1-დან 30-ის ჩათვლით ყველა ლუწი რიცხვის ჯამი
sum = 0
for i in range(1,30,2):
     sum = sum+i
print(sum)