# 1) მომხარებელს შემოატანინე თავისი ასაკი. შემდეგ შეამოწმეთ, თუ მისი ასაკი მეტია 18-ზე, დაბეჭდე True, სხვა შემთხევაში დაბეჭდე False
age = int(input(" введите свой возраст"))
print(age>18)
# 2) მომხარებელს შემოატანინე ორი რიცხვი, და თუ პირველი უნაშთოდ იყოფა მეორეზე დაბეჭდე True, სხვა შემთხვევაში დაბეჭდე False
number1 = int(input("введите число"))
number2 = int(input("введите число"))
print(number1%number2==0)
# 3) შექმენი ცვლადი სადაც შეინახავ შენს სახელს, შემდეგ მომხარებელს შემოატანინე თავისი სახელი და შეადარე, თუ შენი და მომხარებლის შემოტანილი სახელი იგივეა, დაბეჭდე True, სხვა შემთხვევაში დაბეჭდე False

# 4) მომხარებელს შემოატანინე რიცხვი და თუ ის ლუწია დაბეჭდე False, სხვა შემთხვევაში დაბეჭდე True

# 5) ივარჯიშე ლოგიკურ ოპერატორებზე და გააკეთე 2-2 მაგალითი
print(10<4)
print(77>68)
print(54>90)
print(87<83)
print(76<89)
print(76>77)
print(87<78)
print(87>76)
print(76<78)
print(87<93)
print(34>=34)
print(23<=34)
print(23>=12)
print(45>=34)
print(34<=76)