# შექმენი ლისტი შემდეგ მერე ცვლადი გაიგე ლუწი რიცხვი ლისტიდან და გაამრავლე 2 ზე ამის შემდეგ ცვალდას დაუმატე და გამოიტანე შედეგი
numbers = [4,5,2,3,8,7,9]
num = 0
for i in numbers:
    if i % 2 == 0:
        num += (i*2)
print (num)
# შექმნი 3 ლისტი პირველ ლისტში დაამათე ციფრები შემდეგ შეამოწმე ყველა ელემენტი ლისტიდან ლუწია თუ კენტი ლუწი რიცხვები დაამატე მეორე ლისტში კენტი რიცხვები დაამატე მესამე ლისტში და შედეგი გამოიტანე
numbers1 = [3,2,5,6,9,10,4,3,2,5,6,9,0,9,0,10,10]
numbers2 = []
numbers3 = []

for i in numbers1:
    if i % 2 == 0:
        numbers2.append(i)
    else:
        numbers3.append(i)
print(numbers2)
print(numbers3)
# შექმენი ლისტი შემდეგ წაშალე ერთ-ერთი ელემენტი ლისტიდან
list = [34,56,65,78,87,90,9,3,4,5,3,4,5,6,7,7,6,6,6,5,54]

list.remove(6)

print(list)
# 4)შექმენი ლისტი შემდეგ წაშალე(pop) ერთ-ერთი ელემენტი ლისტიდან შემდეგ გამოიტანე შედეგი
list2 = [6,5,6,7,7,8,90,8,78,65,67,32,45,12,21,12,13,51]

list2.pop(5)

print(list2)
# 5)შექმენი ლისტი და გამოიტანე ის ლისტი შემდეგ მომხმარებელს შეეკითხე რომელი ელემენტსი წაშლა უნდა ამ ლისტიდან და წაშალე ეს ლემენტი შემდეგ გამოუტანე შედეგი
list3 = [4,3,5,5,6,76,78,87,98,99,90,97,56,45,34,22,11,12,11,22,56,65,43,56,43,34,23]
print(list3)

words = int(input("please enter a number of elements that you want to deleate: "))

list3.pop(words)

print(list3)
# 6)შექმენით ლისტი შემდეგ შეეკითხეთ მომხმარებელს რამდენი ლემენტის წაშლა უნდა შემდეგ შეეკითხეთ რომელი ელემენტის წაშლა უნდა გამოუტანე საწყისი და საბოლოო შედეგი
list4 = [56,65,52,54,54,55,67,877,76,89,98,0,99,91,92,95,96,97,93,94]

print(list4)

words0 = int(input("please enter how much numbers do you want to delete: "))

for i in range(words0):
    words1 = int(input("please enter a number of element that you want to delete; "))

    list4.remove(words1)

print(list4)