# 1) მომხარებელს შემოატანინე თავისი ასაკი, გაყავი ის 2-ზე და დაბეჭდე 0-დან შემოტანილი რიცხვის ჩათვლით ყველა რიცხვი გამრავლებული 3-ზე
# age = int(input("enter your age"))

# for i in range(int(age/2)):
#     print(i*3)
# 2) შექმენი ცვლადი, სადაც შეინახავ string-ს. for ციკლის გამოყენებით გადაუარე მას და დაბეჭდე თითოეული სიმბოლო 5-ჯერ
# word = "hello"

# for i in word:
#     print(i*5)
# 3) მომხარებელს, for ციკლის დახმარებით შემოატანინე 5 რიცხვი და დაბეჭდე მათი საშუალო არითმეტიკული
sum=0
for i in range(5):
    sum += int(input("enter a number"))
print(sum/5)
# 4) შექმენი პროგრამა, რომელიც მომხარებელს შემოატანინებს ლუწ რიცხვს. თუ მომხარებელმა შემოიტანა კენტი რიცხვი დაუბეჭდე "The Number is Odd" და იქამდე შემოატანინე ახალი რიცხვი სანამ ის არ იქნება კენტი.

while 
# 5) კომენტარებით ახსენი რას აკეთებ elif-ი