# 1) კომენტარებით ახსენი როდის ვიყენებთ for და while ციკლებს. ახსენი რა განსხვავებაა მათ შორის
# while цыкл мы используем на пример когда нам надо чтото повторять до того пока ответ не будет true.
# А цыкл for мы используем на пример когда нам надо чтото повторить до введеного числа.
#  2) მომხარებელს შემოატანინე რიცხვი და დაბეჭდე 1 დან შემოტანილ რიცხვამდე ყველა რიცხვი while ციკლის გამოყენებით
number = int(input("enter a number"))
count = 1
while count < number:
    count+= 1
    print(count)
# 3) დაბეჭდე ყველა ლუწი რიცხვი 100-დან 150-მდე
i = 100
while i < 150:
    i += 2
    print(i)