# 1) wile ციკლის მეშვეობით დაბეჭდე ყველა რიცხვი 1-დან 20-ის ჩათვლით
# i = 0
# while i < 20:
#     i += 1
#     print(i)
# 2) while ციკლის მეშვეობით დაბეჭდე ყოველი მეორე რიცხვი 0-დან 10-ის ჩათვლით
# i = -1
# while i < 10:
#     i += 1
#     print(i)
# 3) while ციკლის გამოყენებით დაბეჭდე ყველა რიცხვი 20-დან 10-მდე
i = 21
while i > 10:
    i -= 1
    print(i)
# 4) კომენტარებით ახსენი, თუ რა არის while ციკლი და რაში შეიძლება დაგვჭირდეს ის
# цыкл while ето функция и она облегчает нам роботу вы спросите как она нам облегчает роботу смотрите если мы 